# ============================================================================
# Homebrew Bundle File
# brew bundle で一括インストール
# ============================================================================

# ----------------------------------------------------------------------------
# パッケージマネージャー
# ----------------------------------------------------------------------------
brew "mise"              # 統一的なバージョンマネージャー（asdfの後継）

# ----------------------------------------------------------------------------
# Shell & Terminal
# ----------------------------------------------------------------------------
brew "starship"          # モダンなプロンプト
brew "tmux"              # ターミナルマルチプレクサ
brew "zsh-completions"   # Zsh補完の追加

# ----------------------------------------------------------------------------
# Modern CLI Tools
# ----------------------------------------------------------------------------
brew "eza"               # 現代的なls（exaの後継）
brew "bat"               # catの代替（シンタックスハイライト付き）
brew "zoxide"            # スマートcd（ディレクトリジャンプ）
brew "fzf"               # ファジーファインダー
brew "ripgrep"           # 高速grep
brew "fd"                # 高速find
brew "jq"                # JSON processor
brew "ghq"               # Gitリポジトリ管理

# ----------------------------------------------------------------------------
# Git
# ----------------------------------------------------------------------------
brew "git"
brew "gh"                # GitHub CLI
brew "git-delta"         # 美しいgit diff

# ----------------------------------------------------------------------------
# Editor
# ----------------------------------------------------------------------------
brew "neovim"            # 現代的なVim

# ----------------------------------------------------------------------------
# Development
# ----------------------------------------------------------------------------
brew "wget"
brew "curl"
brew "tree"

# ----------------------------------------------------------------------------
# Applications (Optional - コメントアウトしておく)
# ----------------------------------------------------------------------------
cask "iterm2"
# cask "visual-studio-code"
# cask "docker"

